# Install Apps here
cask_args appdir: '/Applications'

# run a Brewfile
tap 'homebrew/bundle'

# interactively shell well
brew 'zsh'

# override xcode cli tools' git
brew 'git'

# multiplex the terminals
brew 'tmux'

# multiplex with pbcopy/pbpaste
brew 'reattach-to-user-namespace'

# serialize structured data
brew 'protobuf'

# encrypt data
brew 'gpg'

# store sql data
brew 'postgresql'

# store in-memory data
brew 'redis'

# fetch files
brew 'wget'

# index files well
brew 'ctags'

# search files
brew 'gawk'

# search files more
brew 'the_silver_searcher'

# write code efficiently
brew 'neovim'

# tinker with ml
brew 'python'

# manage language versions
brew 'asdf'

# install some Apps
cask 'notion'
cask 'vlc'
cask 'spotify'
cask 'brave-browser'
cask 'visual-studio-code'
cask 'iterm2'
cask 'slack'
cask '1password'
cask 'expressvpn'
